//手动翻譯API..
export const trans = {
  CNY: "人民幣",
  USD: "美元",
  HKD: "港元",
  GBP: "英镑",
  CAD: "加元",
  AUD: "澳元",
  SGD: "新加坡元",
  JPY: "日元",
  KRW: "韩元",
  THB: "泰铢",
  MYR: "马来西亚林吉特",
  INR: "印度卢比",
  ISK: "冰岛克朗",
  PHP: "菲律宾比索",
  DKK: "丹麦克朗",
  HUF: "匈牙利福林",
  BGN: "保加利亞列弗",
  CHF: "瑞士法郎",
  CZK: "捷克克朗",
  HRK: "克羅埃西亞庫納",
  NOK: "挪威克朗",
  PLN: "波兰兹罗提",
  RON: "罗马尼亚列伊",
  RUB: "俄罗斯卢布",
  SEK: "瑞典克朗",
  TRY: "土耳其里拉",
  MXN: "墨西哥比索",
  NZD: "新西兰元",
  IDR: "印尼盾",
  BRL: "巴西雷亚尔",
  ZAR: "南非南特",
  ILS: "以色列谢克尔",
};

//默认data的数据结构
// ​
// base: "EUR"
// ​
// date: "2020-10-16"
// ​
// rates: {…}
// ​​
// AUD: 1.6555
// ​​
// BGN: 1.9558
// ​​
// BRL: 6.6054
// ​​
// CAD: 1.5497
// ​​
// CHF: 1.0721
// ​​
// CNY: 7.8639
// ​​
// CZK: 27.279
// ​​
// DKK: 7.442
// ​​
// GBP: 0.90915
// ​​
// HKD: 9.0993
// ​​
// HRK: 7.582
// ​​
// HUF: 364.36
// ​​
// IDR: 17317.86
// ​​
// ILS: 3.9673
// ​​
// INR: 86.0715
// ​​
// ISK: 163.2
// ​​
// JPY: 123.59
// ​​
// KRW: 1341.16
// ​​
// MXN: 24.872
// ​​
// MYR: 4.8708
// ​​
// NOK: 10.957
// ​​
// NZD: 1.7746
// ​​
// PHP: 57.148
// ​​
// PLN: 4.5558
// ​​
// RON: 4.8763
// ​​
// RUB: 91.5767
// ​​
// SEK: 10.3593
// ​​
// SGD: 1.5942
// ​​
// THB: 36.608
// ​​
// TRY: 9.33
// ​​
// USD: 1.1741